vtk/Resolution_40/Case2/system/blockMeshDict
FoamFile
{
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}

convertToMeters 1;

vertices (
	(-0.0000223606797749979 0.0000447213595499958 0)
	(0.0000223606797749979 -0.0000447213595499958 0)
	(0.00201180339887499 0.0009500000000000001 0)
	(0.0017881966011250108 0.00095 0)
	(0 0.00105 0)
	(0 0.00095 0)
	(0.0016763932022500212 0.0010499999999999997 0)
	(0.0000447213595499958 0.0020894427190999917 0)
	(-0.0000447213595499958 0.0019105572809000083 0)
	(0.002123606797749979 0.00105 0)
	(0.003876393202250021 0.00095 0)
	(0.00398819660112501 0.00105 0)
	(0.004323606797749979 0.0009500000000000001 0)
	(0.005955278640450004 -0.0000894427190999916 0)
	(0.006044721359549996 0.0000894427190999916 0)
	(0.004211803398874989 0.00105 0)
	(0.006 0.00095 0)
	(0.006 0.00105 0)
	(0.006022360679774998 0.001955278640450004 0)
	(0.005977639320225003 0.002044721359549996 0)
	(-0.0000223606797749979 0.0000447213595499958 0.0001)
	(0.0000223606797749979 -0.0000447213595499958 0.0001)
	(0.00201180339887499 0.0009500000000000001 0.0001)
	(0.0017881966011250108 0.00095 0.0001)
	(0 0.00105 0.0001)
	(0 0.00095 0.0001)
	(0.0016763932022500212 0.0010499999999999997 0.0001)
	(0.0000447213595499958 0.0020894427190999917 0.0001)
	(-0.0000447213595499958 0.0019105572809000083 0.0001)
	(0.002123606797749979 0.00105 0.0001)
	(0.003876393202250021 0.00095 0.0001)
	(0.00398819660112501 0.00105 0.0001)
	(0.004323606797749979 0.0009500000000000001 0.0001)
	(0.005955278640450004 -0.0000894427190999916 0.0001)
	(0.006044721359549996 0.0000894427190999916 0.0001)
	(0.004211803398874989 0.00105 0.0001)
	(0.006 0.00095 0.0001)
	(0.006 0.00105 0.0001)
	(0.006022360679774998 0.001955278640450004 0.0001)
	(0.005977639320225003 0.002044721359549996 0.0001)
);

blocks (
	hex (0 1 2 3 20 21 22 23) (40 448 1) simpleGrading (1 1 1)
	hex (4 5 3 6 24 25 23 26) (40 400 1) simpleGrading (1 1 1)
	hex (7 8 6 9 27 28 26 29) (40 448 1) simpleGrading (1 1 1)
	hex (9 2 10 11 29 22 30 31) (40 400 1) simpleGrading (1 1 1)
	hex (12 10 13 14 32 30 33 34) (40 448 1) simpleGrading (1 1 1)
	hex (15 12 16 17 35 32 36 37) (40 400 1) simpleGrading (1 1 1)
	hex (11 15 18 19 31 35 38 39) (40 448 1) simpleGrading (1 1 1)
	hex (2 9 6 3 22 29 26 23) (40 40 1) simpleGrading (1 1 1)
	hex (12 15 11 10 32 35 31 30) (40 40 1) simpleGrading (1 1 1)
);

edges (
);

boundary (
	walls {
		type wall;
		faces (
			(1 2 21 22)
			(3 0 23 20)
			(5 3 25 23)
			(6 4 26 24)
			(8 6 28 26)
			(9 7 29 27)
			(2 10 22 30)
			(11 9 31 29)
			(10 13 30 33)
			(14 12 34 32)
			(12 16 32 36)
			(17 15 37 35)
			(15 18 35 38)
			(19 11 39 31)
		);
	}
	inlet_0 {
		type patch;
		faces (
			(0 1 20 21)
		);
	}
	inlet_1 {
		type patch;
		faces (
			(4 5 24 25)
		);
	}
	inlet_2 {
		type patch;
		faces (
			(7 8 27 28)
		);
	}
	outlet_0 {
		type patch;
		faces (
			(13 14 33 34)
		);
	}
	outlet_1 {
		type patch;
		faces (
			(16 17 36 37)
		);
	}
	outlet_2 {
		type patch;
		faces (
			(18 19 38 39)
		);
	}
);